START_TEXT = (
    "🎮 *Добро пожаловать в Крестики-Нолики!* ❌⭕\n\n"
    "Я — твой игровой бот, который поможет тебе весело провести время с друзьями прямо здесь, в Telegram.\n\n"
    "📌 *Что я умею:*\n"
    "• /create — создать новую игру\n"
    "• /join — присоединиться к уже созданной игре\n"
    "• /delete — удалить свою игру, если передумал\n"
    "• Ходить, нажимая на клетки поля 🟦\n\n"
    "💡 *Совет:* кинь другу код игры, и он сможет присоединиться за пару секунд!\n\n"
    "Готов? Тогда давай начнём 🚀"
)
HELP_TEXT = (
    "🆘 *Справка по командам*\n\n"
    "Вот что я умею:\n"
    "• /start — приветственное сообщение и краткая инструкция\n"
    "• /create — создать новую игру ❌⭕\n"
    "• /join — присоединиться к уже созданной игре\n"
    "• /delete — удалить свою игру, если передумал\n"
    "• /github — ссылка на мой исходный код 📂\n\n"
    "💡 *Как играть:*\n"
    "1. Создай или найди игру.\n"
    "2. Дождись соперника.\n"
    "3. По очереди нажимайте на клетки поля.\n"
    "4. Побеждает тот, кто первым соберёт три символа в ряд.\n\n"
    "Если остались вопросы — просто напиши мне, и я подскажу 😉"
)
YOU_IN_THIS_GAME = "⚠️ Вы уже в этой игре"
YOU_IN_ANOTHER_GAME = "⚠️ Вы уже участвуете в другой игре"
GAME_NOT_FOUNDED = "❗ Игра с таким ключом не найдена"

YOU_CREATE_GAME = "✅ Вы создали игру {}"
TAKE_GAME = "🎮 Выберете игру:"
NO_ACTIVE_GAME = "📭 Сейчас нет активных игр"

NO_DELETE_GAME = "⚠️ У вас нет созданных игр для удаления"
YOUR_GAME_DELETED = "✅ Ваша игра с кодом {} была удалена."

WORST_DATA = "❗ Некорректные данные"
ANOTHER_MOVE = "❗ Сейчас ходит другой игрок"
NOT_FREE_PLACE = "❗Эта клетка уже занята"

YOU_WIN = "🎉 Поздравляем! Вы победили!"
YOU_LOSE = "😞 К сожалению, победил @{}. Попробуйте еще раз!"
ALL_WIN = "🤝 Ничья!"

FIRST_MOVE = "✅ Игра началась!\n\n1️⃣ Вы ходите первым!\n\nПротивник:\n*{}*"
SECOND_MOVE = "✅ Игра началась!\n\n2️⃣ Вы ходите вторым!\n\nПротивник:\n*{}*"

GITHUB_LINK_TEXT = "🔗 Репозиторий проекта: https://github.com/finniy/TicTacToeBot"
